#+title: Nix + Poetry + LangChain

#+begin_src sh
nix flake check --impure
#+end_src

LangChain depends on a lot of Python libraries, including =azure-ai-vision= and
=jq=. Those do not build under Nix, although there are [[https://github.com/nix-community/poetry2nix/blob/e4089652c5ec524a276cf2f70c96e579d97ba168/overrides/default.nix#L988][patches]] available that
may help.

* Contents                                                        :TOC_3:TOC:
- [[#error-building-jq][Error building jq]]
- [[#python][Python]]
  - [[#version][Version]]
  - [[#dependencies][Dependencies]]

* Error building jq
#+begin_example
direnv: loading ~/code/nix-poetry-langchain/.envrc
direnv: using flake . --impure
warning: Git tree '/Users/jcf/code/nix-poetry-langchain' is dirty
evaluating derivation 'git+file:///Users/jcf/code/nix-poetry-langchain#devShells.aarch64-darwin.default'direnv: ([/nix/store/0zay0jgkxqjd6ij07190s66765glhf3w-direnv-2.32.3/bin/direnv export zsh]) is taking a while to execute. Use CTRL-C to give up.
warning: Git tree '/Users/jcf/code/nix-poetry-langchain' is dirty
direnv: nix-direnv: renewed cache
💡 A .env file was not found, while dotenv integration is enabled.

   To disable it, add `dotenv.enable = false;` to your devenv.nix file.

See https://devenv.sh/integrations/dotenv/ for more information.
Installing dependencies from lock file

Package operations: 3 installs, 0 updates, 0 removals

  • Installing azure-ai-vision (0.11.1b1): Failed

  RuntimeError

  Unable to find installation candidates for azure-ai-vision (0.11.1b1)

  at /nix/store/rxgwiqw2xq9jhjvhcphydzvhz88n2dqf-python3.10-poetry-1.3.0/lib/python3.10/site-packages/poetry/installation/chooser.py:105 in choose_for
      101│
      102│             links.append(link)
      103│
      104│         if not links:
    → 105│             raise RuntimeError(f"Unable to find installation candidates for {package}")
      106│
      107│         # Get the best link
      108│         chosen = max(links, key=lambda link: self._sort_key(package, link))
      109│

  • Installing jq (1.4.1): Failed

  CalledProcessError

  Command '['/Users/jcf/code/nix-poetry-langchain/.venv/bin/python', '-m', 'pip', 'install', '--use-pep517', '--disable-pip-version-check', '--isolated', '--no-input', '--prefix', '/Users/jcf/code/nix-poetry-langchain/.venv', '--no-deps', '/Users/jcf/Library/Caches/pypoetry/artifacts/67/aa/db/bd3ff657f20a9fb40549cb3f017eb3218f1b9f46245430f48fc45b30e2/jq-1.4.1.tar.gz']' returned non-zero exit status 1.

  at /nix/store/33f67f3mxd2jsnr6mx9pmi597gq26zhh-python3-3.10.11/lib/python3.10/subprocess.py:526 in run
       522│             # We don't call process.wait() as .__exit__ does that for us.
       523│             raise
       524│         retcode = process.poll()
       525│         if check and retcode:
    →  526│             raise CalledProcessError(retcode, process.args,
       527│                                      output=stdout, stderr=stderr)
       528│     return CompletedProcess(process.args, retcode, stdout, stderr)
       529│
       530│

The following error occurred when trying to handle this error:


  EnvCommandError

  Command ['/Users/jcf/code/nix-poetry-langchain/.venv/bin/python', '-m', 'pip', 'install', '--use-pep517', '--disable-pip-version-check', '--isolated', '--no-input', '--prefix', '/Users/jcf/code/nix-poetry-langchain/.venv', '--no-deps', '/Users/jcf/Library/Caches/pypoetry/artifacts/67/aa/db/bd3ff657f20a9fb40549cb3f017eb3218f1b9f46245430f48fc45b30e2/jq-1.4.1.tar.gz'] errored with the following return code 1, and output:
  Processing /Users/jcf/Library/Caches/pypoetry/artifacts/67/aa/db/bd3ff657f20a9fb40549cb3f017eb3218f1b9f46245430f48fc45b30e2/jq-1.4.1.tar.gz
    Installing build dependencies: started
    Installing build dependencies: finished with status 'done'
    Getting requirements to build wheel: started
    Getting requirements to build wheel: finished with status 'done'
    Preparing metadata (pyproject.toml): started
    Preparing metadata (pyproject.toml): finished with status 'done'
  Building wheels for collected packages: jq
    Building wheel for jq (pyproject.toml): started
    Building wheel for jq (pyproject.toml): finished with status 'error'
    error: subprocess-exited-with-error

    × Building wheel for jq (pyproject.toml) did not run successfully.
    │ exit code: 1
    ╰─> [167 lines of output]
        running bdist_wheel
        running build
        running build_ext
        checking for a BSD-compatible install... /run/current-system/sw/bin/install -c
        checking whether build environment is sane... yes
        checking for a thread-safe mkdir -p... /run/current-system/sw/bin/mkdir -p
        checking for gawk... no
        checking for mawk... no
        checking for nawk... no
        checking for awk... awk
        checking whether make sets $(MAKE)... no
        checking whether make supports nested variables... no
        checking for gcc... gcc
        checking whether the C compiler works... yes
        checking for C compiler default output file name... a.out
        checking for suffix of executables...
        checking whether we are cross compiling... no
        checking for suffix of object files... o
        checking whether we are using the GNU C compiler... yes
        checking whether gcc accepts -g... yes
        checking for gcc option to accept ISO C89... none needed
        checking whether gcc understands -c and -o together... yes
        checking for style of include used by make... none
        checking dependency style of gcc... none
        checking build system type... arm-apple-darwin22.5.0
        checking host system type... arm-apple-darwin22.5.0
        checking how to print strings... printf
        checking for a sed that does not truncate output... /usr/bin/sed
        checking for grep that handles long lines and -e... /usr/bin/grep
        checking for egrep... /usr/bin/grep -E
        checking for fgrep... /usr/bin/grep -F
        checking for ld used by gcc... /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/ld
        checking if the linker (/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/ld) is GNU ld... no
        checking for BSD- or MS-compatible name lister (nm)... /usr/bin/nm -B
        checking the name lister (/usr/bin/nm -B) interface... BSD nm
        checking whether ln -s works... yes
        checking the maximum length of command line arguments... 786432
        checking how to convert arm-apple-darwin22.5.0 file names to arm-apple-darwin22.5.0 format... func_convert_file_noop
        checking how to convert arm-apple-darwin22.5.0 file names to toolchain format... func_convert_file_noop
        checking for /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/ld option to reload object files... -r
        checking for objdump... objdump
        checking how to recognize dependent libraries... pass_all
        checking for dlltool... no
        checking how to associate runtime and link libraries... printf %s\n
        checking for ar... ar
        checking for archiver @FILE support... no
        checking for strip... strip
        checking for ranlib... ranlib
        checking command to parse /usr/bin/nm -B output from gcc object... ok
        checking for sysroot... no
        checking for a working dd... /run/current-system/sw/bin/dd
        checking how to truncate binary pipes... /run/current-system/sw/bin/dd bs=4096 count=1
        checking for mt... no
        checking if : is a manifest tool... no
        checking for dsymutil... dsymutil
        checking for nmedit... nmedit
        checking for lipo... lipo
        checking for otool... otool
        checking for otool64... no
        checking for -single_module linker flag... yes
        checking for -exported_symbols_list linker flag... yes
        checking for -force_load linker flag... yes
        checking how to run the C preprocessor... gcc -E
        checking for ANSI C header files... yes
        checking for sys/types.h... yes
        checking for sys/stat.h... yes
        checking for stdlib.h... yes
        checking for string.h... yes
        checking for memory.h... yes
        checking for strings.h... yes
        checking for inttypes.h... yes
        checking for stdint.h... yes
        checking for unistd.h... yes
        checking for dlfcn.h... yes
        checking for objdir... .libs
        checking if gcc supports -fno-rtti -fno-exceptions... yes
        checking for gcc option to produce PIC... -fno-common -DPIC
        checking if gcc PIC flag -fno-common -DPIC works... yes
        checking if gcc static flag -static works... no
        checking if gcc supports -c -o file.o... yes
        checking if gcc supports -c -o file.o... (cached) yes
        checking whether the gcc linker (/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/ld) supports shared libraries... yes
        checking dynamic linker characteristics... darwin22.5.0 dyld
        checking how to hardcode library paths into programs... immediate
        checking whether stripping libraries is possible... yes
        checking if libtool supports shared libraries... yes
        checking whether to build shared libraries... yes
        checking whether to build static libraries... yes
        checking whether make sets $(MAKE)... (cached) no
        checking sys/time.h usability... yes
        checking sys/time.h presence... yes
        checking for sys/time.h... yes
        checking for unistd.h... (cached) yes
        checking sys/times.h usability... yes
        checking sys/times.h presence... yes
        checking for sys/times.h... yes
        checking size of int... 4
        checking size of long... 8
        checking for size_t... yes
        checking for working alloca.h... yes
        checking for alloca... yes
        checking that generated files are newer than configure... done
        configure: creating ./config.status
        config.status: creating Makefile
        config.status: creating src/Makefile
        config.status: creating test/Makefile
        config.status: creating sample/Makefile
        config.status: creating onig-config
        config.status: creating src/config.h
        config.status: executing depfiles commands
        config.status: executing libtool commands
        config.status: executing default commands
        Traceback (most recent call last):
          File "/Users/jcf/code/nix-poetry-langchain/.venv/bin/make", line 5, in <module>
            from scripts.proto import main
        ModuleNotFoundError: No module named 'scripts'
        Executing: ./configure CFLAGS=-fPIC --prefix=/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-req-build-8uc_0x9o/_deps/build/onig-install-6.9.4
        Executing: make
        Traceback (most recent call last):
          File "/Users/jcf/code/nix-poetry-langchain/.venv/lib/python3.9/site-packages/pip/_vendor/pep517/in_process/_in_process.py", line 351, in <module>
            main()
          File "/Users/jcf/code/nix-poetry-langchain/.venv/lib/python3.9/site-packages/pip/_vendor/pep517/in_process/_in_process.py", line 333, in main
            json_out['return_val'] = hook(**hook_input['kwargs'])
          File "/Users/jcf/code/nix-poetry-langchain/.venv/lib/python3.9/site-packages/pip/_vendor/pep517/in_process/_in_process.py", line 249, in build_wheel
            return _build_backend().build_wheel(wheel_directory, config_settings,
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/build_meta.py", line 416, in build_wheel
            return self._build_with_temp_dir(['bdist_wheel'], '.whl',
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/build_meta.py", line 401, in _build_with_temp_dir
            self.run_setup()
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/build_meta.py", line 338, in run_setup
            exec(code, locals())
          File "<string>", line 97, in <module>
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/__init__.py", line 107, in setup
            return distutils.core.setup(**attrs)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/core.py", line 185, in setup
            return run_commands(dist)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/core.py", line 201, in run_commands
            dist.run_commands()
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/dist.py", line 969, in run_commands
            self.run_command(cmd)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/dist.py", line 1234, in run_command
            super().run_command(command)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/dist.py", line 988, in run_command
            cmd_obj.run()
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/wheel/bdist_wheel.py", line 343, in run
            self.run_command("build")
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/cmd.py", line 318, in run_command
            self.distribution.run_command(command)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/dist.py", line 1234, in run_command
            super().run_command(command)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/dist.py", line 988, in run_command
            cmd_obj.run()
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/command/build.py", line 131, in run
            self.run_command(cmd_name)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/cmd.py", line 318, in run_command
            self.distribution.run_command(command)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/dist.py", line 1234, in run_command
            super().run_command(command)
          File "/private/var/folders/bt/72h1kztd54n6_fdtn41hn3tc0000gn/T/nix-shell.nlXOvx/pip-build-env-jesf6aa3/overlay/lib/python3.9/site-packages/setuptools/_distutils/dist.py", line 988, in run_command
            cmd_obj.run()
          File "<string>", line 39, in run
          File "<string>", line 44, in _build_oniguruma
          File "<string>", line 78, in _build_lib
          File "<string>", line 75, in run_command
          File "/nix/store/2z071jgggglas5szpc5q2bbgbn042wf8-python3-3.9.17/lib/python3.9/subprocess.py", line 373, in check_call
            raise CalledProcessError(retcode, cmd)
        subprocess.CalledProcessError: Command '['make']' returned non-zero exit status 1.
        [end of output]

    note: This error originates from a subprocess, and is likely not a problem with pip.
    ERROR: Failed building wheel for jq
  Failed to build jq
  ERROR: Could not build wheels for jq, which is required to install pyproject.toml-based projects


  at /nix/store/rxgwiqw2xq9jhjvhcphydzvhz88n2dqf-python3.10-poetry-1.3.0/lib/python3.10/site-packages/poetry/utils/env.py:1540 in _run
      1536│                 output = subprocess.check_output(
      1537│                     command, stderr=subprocess.STDOUT, env=env, **kwargs
      1538│                 )
      1539│         except CalledProcessError as e:
    → 1540│             raise EnvCommandError(e, input=input_)
      1541│
      1542│         return decode(output)
      1543│
      1544│     def execute(self, bin: str, *args: str, **kwargs: Any) -> int:

The following error occurred when trying to handle this error:


  PoetryException

  Failed to install /Users/jcf/Library/Caches/pypoetry/artifacts/67/aa/db/bd3ff657f20a9fb40549cb3f017eb3218f1b9f46245430f48fc45b30e2/jq-1.4.1.tar.gz

  at /nix/store/rxgwiqw2xq9jhjvhcphydzvhz88n2dqf-python3.10-poetry-1.3.0/lib/python3.10/site-packages/poetry/utils/pip.py:58 in pip_install
       54│
       55│     try:
       56│         return environment.run_pip(*args)
       57│     except EnvCommandError as e:
    →  58│         raise PoetryException(f"Failed to install {path.as_posix()}") from e
       59│

Poetry install failed. Run 'poetry install' manually.
direnv: export +C_INCLUDE_PATH +DEVENV_DOTFILE +DEVENV_PROFILE +DEVENV_ROOT +DEVENV_STATE +IN_NIX_SHELL +LD_LIBRARY_PATH +LIBRARY_PATH +PKG_CONFIG_PATH +POETRY_VIRTUALENVS_CREATE +POETRY_VIRTUALENVS_IN_PROJECT +POETRY_VIRTUALENVS_PATH +PYTHONPATH +VIRTUAL_ENV +name ~PATH ~XDG_CONFIG_DIRS ~XDG_DATA_DIRS
#+end_example

* Python
** Version
#+begin_src sh :exports both
python --version
#+end_src

#+results:
: Python 3.9.17

** Dependencies
#+begin_src sh :results output verbatim :exports both
poetry show
#+end_src

#+results:
#+begin_example
aioboto3                                     11.2.0       Async boto3 wrapper
aiobotocore                                  2.5.0        Async client for ...
aiodns                                       3.0.0        Simple DNS resolv...
aiofiles                                     23.1.0       File support for ...
aiohttp                                      3.8.4        Async http client...
aiohttp-retry                                2.8.3        Simple retry clie...
aioitertools                                 0.11.0       itertools and bui...
aiosignal                                    1.3.1        aiosignal: a list...
aleph-alpha-client                           2.17.0       python client to ...
anthropic                                    0.3.2        Client library fo...
anyio                                        3.7.1        High level compat...
appdirs                                      1.4.4        A small Python mo...
arxiv                                        1.4.7        Python wrapper fo...
asgiref                                      3.7.2        ASGI specs, helpe...
async-timeout                                4.0.2        Timeout context m...
atlassian-python-api                         3.39.0       Python Atlassian ...
attr                                         0.3.2        Simple decorator ...
attrs                                        23.1.0       Classes Without B...
authlib                                      1.2.1        The ultimate Pyth...
awadb                                        0.3.6        The AI Native dat...
azure-ai-formrecognizer                      3.2.1        Microsoft Azure F...
azure-ai-vision                          (!) 0.11.1b1     Microsoft Azure A...
azure-cognitiveservices-speech               1.30.0       Microsoft Cogniti...
azure-common                                 1.1.28       Microsoft Azure C...
azure-core                                   1.28.0       Microsoft Azure C...
azure-cosmos                                 4.4.0        Microsoft Azure C...
azure-identity                               1.13.0       Microsoft Azure I...
backoff                                      2.2.1        Function decorati...
beautifulsoup4                               4.12.2       Screen-scraping l...
blis                                         0.7.9        The Blis BLAS-lik...
boto3                                        1.26.76      The AWS SDK for P...
botocore                                     1.29.76      Low-level, data-d...
brotli                                       1.0.9        Python bindings f...
build                                        0.10.0       A simple, correct...
cachetools                                   5.3.1        Extensible memoiz...
catalogue                                    2.0.8        Super lightweight...
certifi                                      2023.5.7     Python package fo...
cffi                                         1.15.1       Foreign Function ...
charset-normalizer                           3.2.0        The Real First Un...
clarifai                                     9.5.4        Clarifai Python U...
clarifai-grpc                                9.6.0        Clarifai gRPC API...
click                                        8.1.4        Composable comman...
clickhouse-connect                           0.5.25       ClickHouse core d...
cohere                                       3.10.0       A Python library ...
confection                                   0.1.0        The sweetest conf...
contourpy                                    1.1.0        Python library fo...
cryptography                                 41.0.1       cryptography is a...
cycler                                       0.11.0       Composable style ...
cymem                                        2.0.7        Manage calls to c...
dataclasses-json                             0.5.9        Easily serialize ...
decorator                                    5.1.1        Decorators for Hu...
deeplake                                     3.6.8        Activeloop Deep Lake
deprecated                                   1.2.14       Python @deprecate...
dill                                         0.3.6        serialize all of ...
distro                                       1.8.0        Distro - an OS pl...
dnspython                                    2.3.0        DNS toolkit
docarray                                     0.32.1       The data structur...
docker                                       6.1.3        A Python library ...
docker-pycreds                               0.4.0        Python bindings f...
duckduckgo-search                            3.8.3        Search for words,...
ecdsa                                        0.18.0       ECDSA cryptograph...
elastic-transport                            8.4.0        Transport classes...
elasticsearch                                8.8.2        Python client for...
entrypoints                                  0.4          Discover and load...
esprima                                      4.0.1        ECMAScript parsin...
et-xmlfile                                   1.1.0        An implementation...
exceptiongroup                               1.1.2        Backport of PEP 6...
faiss-cpu                                    1.7.4        A library for eff...
fastapi                                      0.95.2       FastAPI framework...
feedparser                                   6.0.10       Universal feed pa...
filelock                                     3.12.2       A platform indepe...
fluent-logger                                0.10.0       A Python logging ...
fonttools                                    4.40.0       Tools to manipula...
frozenlist                                   1.3.3        A list-like struc...
fsspec                                       2023.6.0     File-system speci...
future                                       0.18.3       Clean single-sour...
geojson                                      2.5.0        Python bindings a...
gitdb                                        4.0.10       Git Object Database
gitpython                                    3.1.31       GitPython is a Py...
google-api-core                              2.11.1       Google API client...
google-api-python-client                     2.70.0       Google API Client...
google-auth                                  2.21.0       Google Authentica...
google-auth-httplib2                         0.1.0        Google Authentica...
google-search-results                        2.4.2        Scrape and search...
googleapis-common-protos                     1.59.1       Common protobufs ...
gptcache                                     0.1.35       GPTCache, a power...
grpcio                                       1.47.5       HTTP/2-based RPC ...
grpcio-health-checking                       1.47.5       Standard Health C...
grpcio-reflection                            1.47.5       Standard Protobuf...
grpcio-tools                                 1.47.5       Protobuf code gen...
h11                                          0.14.0       A pure-Python, br...
h2                                           4.1.0        HTTP/2 State-Mach...
hnswlib                                      0.7.0        hnswlib
hpack                                        4.0.0        Pure-Python HPACK...
html2text                                    2020.1.16    Turn HTML into eq...
httpcore                                     0.17.3       A minimal low-lev...
httplib2                                     0.22.0       A comprehensive H...
httptools                                    0.6.0        A collection of f...
httpx                                        0.24.1       The next generati...
huggingface-hub                              0.16.4       Client library to...
humbug                                       0.3.1        Humbug: Do you bu...
hyperframe                                   6.0.1        HTTP/2 framing la...
idna                                         3.4          Internationalized...
importlib-metadata                           6.0.1        Read metadata fro...
importlib-resources                          6.0.0        Read resources fr...
inflection                                   0.5.1        A port of Ruby on...
isodate                                      0.6.1        An ISO 8601 date/...
jaraco-context                               4.3.0        Context managers ...
jcloud                                       0.2.12       Simplify deployin...
jina                                         3.19.0       Multimodal AI ser...
jina-hubble-sdk                              0.39.0       SDK for Hubble AP...
jinja2                                       3.1.2        A very fast and e...
jmespath                                     1.0.1        JSON Matching Exp...
joblib                                       1.3.1        Lightweight pipel...
jq                                       (!) 1.4.1        jq is a lightweig...
jsonlines                                    3.1.0        Library with help...
kiwisolver                                   1.4.4        A fast implementa...
lancedb                                      0.1.10       lancedb
langchain                                (!) 0.0.229      Building applicat...
langchainplus-sdk                            0.0.20       Client library to...
langcodes                                    3.3.0        Tools for labelin...
langkit                                      0.0.4        A collection of t...
lark                                         1.1.5        a modern parsing ...
loguru                                       0.7.0        Python logging ma...
lxml                                         4.9.3        Powerful and Pyth...
lz4                                          4.3.2        LZ4 Bindings for ...
manifest-ml                                  0.0.1        Manifest for Prom...
markdown-it-py                               3.0.0        Python port of ma...
markupsafe                                   2.1.3        Safely add untrus...
marqo                                        0.11.0       Tensor search for...
marshmallow                                  3.19.0       A lightweight lib...
marshmallow-enum                             1.5.1        Enum field for Ma...
matplotlib                                   3.7.1        Python plotting p...
mdurl                                        0.1.2        Markdown URL util...
mmh3                                         3.1.0        Python wrapper fo...
momento                                      1.6.1        SDK for Momento
momento-wire-types                           0.64.1       Momento Client Pr...
more-itertools                               9.1.0        More routines for...
msal                                         1.22.0       The Microsoft Aut...
msal-extensions                              1.0.0        Microsoft Authent...
msgpack                                      1.0.5        MessagePack seria...
msrest                                       0.7.1        AutoRest swagger ...
multidict                                    6.0.4        multidict impleme...
multiprocess                                 0.70.14      better multiproce...
murmurhash                                   1.0.9        Cython bindings f...
mypy-extensions                              1.0.0        Type system exten...
nebula3-python                               3.4.0        Python client for...
neo4j                                        5.10.0       Neo4j Bolt driver...
nest-asyncio                                 1.5.6        Patch asyncio to ...
networkx                                     2.8.8        Python package fo...
nlpcloud                                     1.1.43       Python client for...
nltk                                         3.8.1        Natural Language ...
nomic                                        1.1.14       The offical Nomic...
numcodecs                                    0.11.0       A Python package ...
numexpr                                      2.8.4        Fast numerical ex...
numpy                                        1.25.1       Fundamental packa...
o365                                         2.0.27       Microsoft Graph a...
oauthlib                                     3.2.2        A generic, spec-c...
octoai-sdk                                   0.1.2        A runtime library...
openai                                       0.27.8       Python client lib...
openapi-schema-pydantic                      1.2.4        OpenAPI (v3) spec...
openlm                                       0.0.5        Drop-in OpenAI-co...
openpyxl                                     3.1.2        A Python library ...
opensearch-py                                2.2.0        Python client for...
opentelemetry-api                            1.18.0       OpenTelemetry Pyt...
opentelemetry-exporter-otlp                  1.18.0       OpenTelemetry Col...
opentelemetry-exporter-otlp-proto-common     1.18.0       OpenTelemetry Pro...
opentelemetry-exporter-otlp-proto-grpc       1.18.0       OpenTelemetry Col...
opentelemetry-exporter-otlp-proto-http       1.18.0       OpenTelemetry Col...
opentelemetry-exporter-prometheus            1.12.0rc1    Prometheus Metric...
opentelemetry-instrumentation                0.39b0       Instrumentation T...
opentelemetry-instrumentation-aiohttp-client 0.39b0       OpenTelemetry aio...
opentelemetry-instrumentation-asgi           0.39b0       ASGI instrumentat...
opentelemetry-instrumentation-fastapi        0.39b0       OpenTelemetry Fas...
opentelemetry-instrumentation-grpc           0.39b0       OpenTelemetry gRP...
opentelemetry-proto                          1.18.0       OpenTelemetry Pyt...
opentelemetry-sdk                            1.18.0       OpenTelemetry Pyt...
opentelemetry-semantic-conventions           0.39b0       OpenTelemetry Sem...
opentelemetry-util-http                      0.39b0       Web util for Open...
orjson                                       3.9.2        Fast, correct Pyt...
packaging                                    23.1         Core utilities fo...
pandas                                       2.0.3        Powerful data str...
pandas-stubs                                 2.0.2.230605 Type annotations ...
pathos                                       0.3.0        parallel graph ma...
pathspec                                     0.11.1       Utility library f...
pathtools                                    0.1.2        File system gener...
pathy                                        0.10.2       pathlib.Path subc...
pdfminer-six                                 20221105     PDF parser and an...
pexpect                                      4.8.0        Pexpect allows ea...
pgvector                                     0.1.8        pgvector support ...
pillow                                       9.5.0        Python Imaging Li...
pinecone-client                              2.2.2        Pinecone client a...
pinecone-text                                0.4.2        Text utilities li...
platformdirs                                 3.8.1        A small Python pa...
plotly                                       5.15.0       An open-source, i...
portalocker                                  2.7.0        Wraps the portalo...
pox                                          0.3.2        utilities for fil...
ppft                                         1.7.6.6      distributed and p...
preshed                                      3.0.8        Cython hash table...
prometheus-client                            0.17.0       Python client for...
protobuf                                     3.20.3       Protocol Buffers
psutil                                       5.9.5        Cross-platform li...
psycopg2-binary                              2.9.6        psycopg2 - Python...
ptyprocess                                   0.7.0        Run a subprocess ...
py                                           1.11.0       library with cros...
pyarrow                                      12.0.1       Python library fo...
pyasn1                                       0.5.0        Pure-Python imple...
pyasn1-modules                               0.3.0        A collection of A...
pycares                                      4.3.0        Python interface ...
pycparser                                    2.21         C parser in Python
pydantic                                     1.10.11      Data validation a...
pygments                                     2.15.1       Pygments is a syn...
pyjwt                                        2.7.0        JSON Web Token im...
pylance                                      0.5.3        python wrapper fo...
pymongo                                      4.4.0        Python driver for...
pyowm                                        3.3.0        A Python wrapper ...
pyparsing                                    3.1.0        pyparsing module ...
pypdf                                        3.12.1       A pure-python PDF...
pyphen                                       0.14.0       Pure Python modul...
pyproject-hooks                              1.0.0        Wrappers to call ...
pysocks                                      1.7.1        A Python SOCKS cl...
pytesseract                                  0.3.10       Python-tesseract ...
python-dateutil                              2.8.2        Extensions to the...
python-dotenv                                1.0.0        Read key-value pa...
python-jose                                  3.3.0        JOSE implementati...
python-multipart                             0.0.6        A streaming multi...
python-rapidjson                             1.10         Python wrapper ar...
pytz                                         2023.3       World timezone de...
pytz-deprecation-shim                        0.1.0.post0  Shims to make dep...
pyvespa                                      0.33.0       Python API for ve...
pyyaml                                       6.0          YAML parser and e...
qdrant-client                                1.1.7        Client library fo...
ratelimiter                                  1.2.0.post0  Simple python rat...
rdflib                                       6.3.2        RDFLib is a Pytho...
redis                                        4.6.0        Python client for...
regex                                        2023.6.3     Alternative regul...
requests                                     2.28.2       Python HTTP for H...
requests-oauthlib                            1.3.1        OAuthlib authenti...
requests-toolbelt                            1.0.0        A utility belt fo...
retry                                        0.9.2        Easy to use retry...
rich                                         13.4.2       Render rich text,...
rsa                                          4.9          Pure-Python RSA i...
s3transfer                                   0.6.1        An Amazon S3 Tran...
safetensors                                  0.3.1        Fast and Safe Ten...
scikit-learn                                 1.3.0        A set of python m...
scipy                                        1.11.1       Fundamental algor...
semver                                       3.0.1        Python helper for...
sentence-transformers                        2.2.2        Multilingual text...
sentencepiece                                0.1.99       SentencePiece pyt...
sentry-sdk                                   1.28.0       Python client for...
setproctitle                                 1.3.2        A Python module t...
setuptools                                   68.0.0       Easily download, ...
sgmllib3k                                    1.0.0        Py3k port of sgml...
singlestoredb                                0.7.1        Interface to the ...
six                                          1.16.0       Python 2 and 3 co...
smart-open                                   6.3.0        Utils for streami...
smmap                                        5.0.0        A pure Python imp...
sniffio                                      1.3.0        Sniff out which a...
socksio                                      1.0.0        Sans-I/O implemen...
soundfile                                    0.12.1       An audio library ...
soupsieve                                    2.4.1        A modern CSS sele...
spacy                                        3.6.0        Industrial-streng...
spacy-legacy                                 3.0.12       Legacy registered...
spacy-loggers                                1.0.4        Logging utilities...
sqlalchemy                                   2.0.18       Database Abstract...
sqlitedict                                   2.1.0        Persistent dict i...
sqlparams                                    5.1.0        Convert between v...
srsly                                        2.4.6        Modern high-perfo...
starlette                                    0.27.0       The little ASGI l...
steamship                                    2.17.14      The fastest way t...
stringcase                                   1.2.0        String case conve...
tenacity                                     8.2.2        Retry code until ...
textstat                                     0.7.3        Calculate statist...
thinc                                        8.1.10       A refreshing func...
threadpoolctl                                3.1.0        threadpoolctl
tigrisdb                                     1.0.0b6      Python SDK for Ti...
tiktoken                                     0.3.3        tiktoken is a fas...
tokenizers                                   0.13.3       Fast and Customiz...
toml                                         0.10.2       Python Library fo...
tomli                                        2.0.1        A lil' TOML parser
torch                                        1.13.1       Tensors and Dynam...
torchvision                                  0.14.1       image and video d...
tqdm                                         4.65.0       Fast, Extensible ...
transformers                                 4.30.2       State-of-the-art ...
tritonclient                                 2.34.0       Python client lib...
typer                                        0.9.0        Typer, build grea...
types-pytz                                   2023.3.0.0   Typing stubs for ...
types-pyyaml                                 6.0.12.10    Typing stubs for ...
types-requests                               2.31.0.1     Typing stubs for ...
types-urllib3                                1.26.25.13   Typing stubs for ...
typing-extensions                            4.7.1        Backported and Ex...
typing-inspect                               0.9.0        Runtime inspectio...
tzdata                                       2023.3       Provider of IANA ...
tzlocal                                      4.3.1        tzinfo object for...
uritemplate                                  4.1.1        Implementation of...
urllib3                                      1.26.16      HTTP library with...
uvicorn                                      0.22.0       The lightning-fas...
uvloop                                       0.17.0       Fast implementati...
validators                                   0.20.0       Python Data Valid...
wandb                                        0.15.5       A CLI and library...
wasabi                                       1.1.2        A lightweight con...
watchfiles                                   0.19.0       Simple, modern an...
weaviate-client                              3.22.1       A python native W...
websocket-client                             1.6.1        WebSocket client ...
websockets                                   11.0.3       An implementation...
wget                                         3.2          pure python downl...
wheel                                        0.40.0       A built-package f...
whylabs-client                               0.5.2        WhyLabs API client
whylogs                                      1.2.1        Profile and monit...
whylogs-sketching                            3.4.1.dev3   sketching library...
wikipedia                                    1.4.0        Wikipedia API for...
wolframalpha                                 5.0.0        Wolfram|Alpha 2.0...
wonderwords                                  2.2.0        A python package ...
wrapt                                        1.15.0       Module for decora...
xmltodict                                    0.13.0       Makes working wit...
yarl                                         1.9.2        Yet another URL l...
zipp                                         3.16.0       Backport of pathl...
zstandard                                    0.21.0       Zstandard binding...
#+end_example
